In [1]:
from kaggle_handler import handler
import pandas as pd
import numpy as np

In [2]:
Assets = handler()

Directory 'Assets' already exists.
Datasets already exist in Assets folder
['lung_cancer_prediction_dataset.csv', 'Titanic-Dataset.csv', 'GenZ_DatingApp_Data.csv', 'concrete_data.csv']
 Change Add_more parameter to download more datasets

In [3]:
Assets

['lung_cancer_prediction_dataset.csv',
 'Titanic-Dataset.csv',
 'GenZ_DatingApp_Data.csv',
 'concrete_data.csv']

In [4]:
df = pd.read_csv('Assets/Titanic-Dataset.csv', usecols=["Ticket","Cabin"])
df.sample(5)

          Ticket Cabin
570  S.W./PP 752   NaN
650       349221   NaN
580       237789   NaN
17        244373   NaN
666       234686   NaN

In [5]:
df.dropna(inplace=True,ignore_index=True)

In [6]:
df.sample(5)

         Ticket Cabin
161      113028  C124
160    PC 17482   C90
201       11767   C50
133      110413   E68
150  F.C. 12750   B71

In [7]:
df['Ticket_number'] = df['Ticket'].apply(lambda val: pd.to_numeric(val.split(),errors='coerce',downcast='integer'))
df['Ticket_number'] = df['Ticket_number'].apply(lambda val: val[0] if len(val)==1 else val[1] if len(val)==2 else val[2])
df['Ticket_number'] = df['Ticket_number'].astype('int32')

In [8]:
df['Ticket_code'] = df['Ticket'].str.split()
df['Ticket_code'] = df[['Ticket_code','Ticket_number']].apply(lambda x: x[0][0] if x[0][0]!=str(int(x[1])) else np.nan, axis=1)
df['Ticket_code'].unique()

/tmp/ipykernel_169488/4021208687.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['Ticket_code'] = df[['Ticket_code','Ticket_number']].apply(lambda x: x[0][0] if x[0][0]!=str(int(x[1])) else np.nan, axis=1)

array(['PC', nan, 'PP', 'C.A.', 'W.E.P.', 'SC/Paris', 'SOTON/O.Q.',
       'SC/AH', 'WE/P', 'F.C.', 'S.O./P.P.'], dtype=object)

In [9]:
df.sample(5)

    Ticket        Cabin  Ticket_number Ticket_code
134  13567          B41          13567         NaN
153  24160           B5          24160         NaN
109  11771          B37          11771         NaN
111  36947          D20          36947         NaN
80   19950  C23 C25 C27          19950         NaN

In [10]:
df['Cabin_list'] = df['Cabin'].str.split(r'(\d+)')
# df['Cabin_list'] = df['Cabin'].apply(lambda val: list(val))
df['Cabin_number'] = df['Cabin_list'].apply(lambda val: pd.to_numeric(val,errors='coerce',downcast='float'))
df['Cabin_number'] = df['Cabin_number'].apply(np.nan_to_num)
df['Cabin_number'] = df['Cabin_number'].apply(lambda val: [i for i in val if i!=0.0])
df['Cabin_number'] = df['Cabin_number'].apply(lambda val: val[0] if val!=[] else np.nan)

In [11]:
df['Cabin_code'] = df[['Cabin_list','Cabin_number']].apply(lambda x: x[0][0] if isinstance(x[0][0],(str)) else np.nan, axis=1)
df['Cabin_code'].unique()

/tmp/ipykernel_169488/2102975219.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['Cabin_code'] = df[['Cabin_list','Cabin_number']].apply(lambda x: x[0][0] if isinstance(x[0][0],(str)) else np.nan, axis=1)

array(['C', 'E', 'G', 'D', 'A', 'B', 'F', 'F G', 'F E', 'T'], dtype=object)

In [12]:
df.drop(columns=['Cabin_list'], inplace=True)

In [13]:
df.sample(5)

       Ticket    Cabin  Ticket_number Ticket_code  Cabin_number Cabin_code
88     113760  B96 B98         113760         NaN          96.0          B
113    110152      B79         110152         NaN          79.0          B
90    PP 9549       G6           9549          PP           6.0          G
118     12749      B73          12749         NaN          73.0          B
114  PC 17758      C65          17758          PC          65.0          C